import {Injectable} from '@angular/core';
import {HttpClient} from '@angular/common/http';
import {Field} from '../components/main-map/main-map.component';
import {Observable} from 'rxjs/Observable';
import {BehaviorSubject} from 'rxjs/BehaviorSubject';

@Injectable()
export class AppService {
  private readonly url = 'https://sowingapi.azurewebsites.net/api/';
  private _cultures = [
    {
      name: 'Пшениця',
      description: 'Рід трав\'янистих, в основному однорічних, рослин сімейства Злаки, або Тонконогі (Poaceae), провідна зернова культура в багатьох країнах.',
      photo: 'https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Weizen%C3%A4hren.jpg/275px-Weizen%C3%A4hren.jpg',
      url: 'https://uk.wikipedia.org/wiki/%D0%9F%D1%88%D0%B5%D0%BD%D0%B8%D1%86%D1%8F'
    },
    {
      name: 'Соняшник',
      description: 'Рід рослин сімейства Айстрові (Asteraceae). Найбільш відомі види - соняшник олійний і соняшник клубненосний.',
      photo: 'https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/A_sunflower.jpg/258px-A_sunflower.jpg',
      url: 'https://uk.wikipedia.org/wiki/%D0%A1%D0%BE%D0%BD%D1%8F%D1%88%D0%BD%D0%B8%D0%BA'
    },
    {
      name: 'Гречка',
      description: 'Рослина роду Fagopyrum родини Гречкові (Polygonaceae). Зазвичай гречкою називають Fagopyrum esculentum, що може виростати до одного метра на бідних ґрунтах і при короткому літі. Має дуже поживні темні трикутні зерна, які люди вживають для харчування, а також використовують у тваринних кормах.',
      photo: 'https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Illustration_Fagopyrum_esculentum0.jpg/260px-Illustration_Fagopyrum_esculentum0.jpg',
      url: 'https://uk.wikipedia.org/wiki/%D0%93%D1%80%D0%B5%D1%87%D0%BA%D0%B0'
    },
    {
      name: 'Кукуруза',
      description: 'Однорічна рослина родини Тонконогових. Одна з найвисокопродуктивніших злакових культур універсального призначення, яку разом з рисом і пшеницею відносять до одного з «трьох найголовніших хлібів людства».',
      photo: 'https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/ZeaMays.jpg/172px-ZeaMays.jpg',
      url: 'https://uk.wikipedia.org/wiki/%D0%9A%D1%83%D0%BA%D1%83%D1%80%D1%83%D0%B4%D0%B7%D0%B0'
    },
    {
      name: 'Картопля',
      description: 'Вид рослин родини пасльонових, поширена сільськогосподарська культура, яку в народі називають «другим хлібом»;[1][2][3][4] одна з найважливіших продовольчих, технічних і кормових культур.',
      photo: 'https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Solanum_tuberosum.JPG/275px-Solanum_tuberosum.JPG',
      url: 'https://uk.wikipedia.org/wiki/%D0%9A%D0%B0%D1%80%D1%82%D0%BE%D0%BF%D0%BB%D1%8F'
    },
    {
      name: 'Соя',
      description: 'Однорічна трав\'яниста культурна рослина родини бобових, зовні подібна до квасолі, одна з найдавніших їстівних культур.',
      photo: 'https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Soybean.USDA.jpg/258px-Soybean.USDA.jpg',
      url: 'https://uk.wikipedia.org/wiki/%D0%A1%D0%BE%D1%8F'
    },
  ];
  private _news = [
    {
      'id': 1,
      'description': 'Англійці навчились вирощувати картоплю без ґрунту',
      'photoUrl': 'https://agronews.ua/sites/default/files/images/366_3.640.jpg',
      'data': '22 березня 2018',
      'content': `Уже в кінці травня англійська фірма Airponix планує зібрати перший врожай картоплі, вирощеної без ґрунту. На думку авторів проекту, це багатообіцяючий
      крок до нової технології вирощування картоплі та овочів з мінімальними витратами і навантаженням на навколишнє середовище. У новій теплиці площею 1 тис. м², розташованої
      в графстві Норфолк, картоплю вирощують в довгих поліетиленових рукавах, в які періодично подається дрібнодисперсний туман, що містить всі необхідні макро - і мікроелементи,
      передає fruit - inform.com. За словами Майкла Ружі, одного із засновників фірми, проведені експерименти свідчать, що за допомогою такої технології можна вирощувати картоплю
      та інші культури зі значно меншими витратами, ніж зазвичай. Якість продукції при цьому вище, що дозволяє успішно конкурувати на ринку з традиційними виробниками. «Витрати
      порівняно низькі, витрата енергії теж невелика. Збирання врожаю вимагає менше ручної праці, при цьому картоплю не потрібно мити перед продажем. Знижується і залежність
      від погодних умов. Цю технологію можна застосовувати і в регіонах, де традиційне землеробство неможливе або утруднене», — зазначають представники компанії Airponix. Нова
      технологія також дозволяє практично обійтися без застосування засобів захисту рослин. За словами авторів проекту, застосування технології дрібнодисперсного розпилу є значним
      поліпшенням інших методів аеропоніки. Дрібні краплі розчину особливо придатні для вирощування рису, пшениці і картоплі. Перший урожай картоплі очікується уже наприкінці травня.`
    },
    {
      'id': 2,
      'description': 'В Україні відкрили Центр по боротьбі з незаконними пестицидами',
      'data': '22 березня 2018',
      'photoUrl': 'https://agronews.ua/sites/default/files/images/336_4.640.jpg',
      'content': `Спеціальна програма ООН з довкілля (ЮНЕП) у партнерстві з ГО «Самодопомога Закарпаття» запускає Інформаційний центр «Фермерськй патруль» з метою протиді
      незаконному обігу пестицидів на кордоні України з Угорщиною, Словаччиною, Чеською Республікою а Румунією.Про це повідомила прес-служба ФАО. Даний Центр починає
       загальнонаціональну акцію по допомозі постраждалим агровиробникам від придбання контрафактних або непридатних пестицидів. Окрім Центру в Ужгороді, планується відкриття
    подібних організацій в Одеській та Київській областях країни до кінця 2018 року. Створення та підтримка Інформаційних центрів по боротьбі з контрафактом відбувається
    у рамках проекту по підвищенню хімічної безпеки в Україні та зміцненню регулюючих інституцій та законодавства у даній галузі.  Даний проект, розпочатий на початку
    минулого року,  працює над питаннями оптимізації виконання Роттердамської конвенції, що покликана допомагати країнам - учасницям протистояти небажаній торгівлі хімічними
    речовинами, та погодження методів поширення інформації між урядовими департаментами, бізнесом та споживачами. До команди Інформаційного центру «Фермерський патруль»
  увійшли юристи, екологи, фахівці ринку засобів захисту рослин, що у співпраці з національними митними та правоохронними органами надавадимуть фахову консультацію з
  можливих способів реагування на ідентифікацію або придбання підозрілих ЗЗР, включно з питаннями потенційного відшкодування завданих збитків внаслідок застосування
  підробного продукту. Експерти активно займатимуться просвітницькою діяльністью на території Закарпатської, Чернівецької, Івано-Франківської, Львівської та Волинської
  областей, будуть регулярно проводити польові семінари з фермерами щодо проблематики нелегального обігу пестицидів та розповсюджувати дані про розташування офіційних
  мереж продажів оригінальних засобів захисту рослин. Одночасно з відкриттям Інформаційного центру, фахівці проекту провели дводенний тренінг для фахівців державних
  екологічних служб та митних органів з питань ідентифікації та затримання контрафактних пестицидів при перетині державного кордону. Учасники обговорили процедури митного
  оформлення, затримки або фіксування порушення митних правил, наповнення профілів ризиків для відповідих товарних груп. Інспектори - учасники заходу погодились, що
  потребують допомоги екологічних та правоохоронних служб для підвищення ефективності митного контролю. Міжнародні експерти, у свою чергу, внесли пропозицію скорочення
  пунктів входу та введення обміну розвідувальними даними через RILO. «Наш захід сьогодні є визначним моментом у формуванні реальних потужностей та підвищення фахової
  кваліфікації у боротьбі з контрафактними хімічними речовинами в Україні.  Нам вдалося об’єднати за одним столом усіх зацікавлених сторін цьго процесу – державних
  органів митного контролю, екологічних інспекторів, представників бізнесу та науки», - сказав Ярема Герцик, провідний фахівець проекту Спеціальної програми ЮНЕП.
«Така зутріч  надала нам можливість практичного аналізу законодавчих прогалин, глибшого вивчення ринку підробних ЗЗР та погодження підходів до більш дієвого партнерства
  між усіма задіяними службами та кращого відслідковування кінцевого споживача». Нагадаємо, що Спеціальна програма ЮНЕП  спрямована на підтримку інституціонального розвитку
  країн для ефективнішої реалізації Базельскої, Роттердамської, та Стокгольмської конвенцій, Мінаматської конвенції та Стратегічного підходу до міжнародного регулювання
  хімічними речовинами (SAICM). Основним отримувачем допомоги в рамках проекту визначено Міністерство екології та природних ресурсів України, а загальний бюджет
  становить близько 230 тисяч доларів США. До розгляду на участь у Програмі було подано 54 заявки з 45 країн світу, і Україна стала однією з семи країн, що отримала
  фінансування в рамках даного проекту.  Реалізацію покладено на міжнародну неурядову організацію Green Cross Switzerland. Проект працюватиме до квітня 2019 року.
  Довідка/:
    Україна приєдналася до Роттердамської конвенції у 2002 році. Метою конвенції є сприяння запровадженню спільної відповідальності та узгоджених зусиль Сторін у
  міжнародній торгівлі окремими небезпечними хімічними речовинами з метою охорони здоров’я людини та навколишнього середовища від потенційно шкідливого впливу. Процедура
  попереднього погодження пропонує механізм офіційного отримання і поширення рішень країн - імпортерів відносно того, чи бажають вони поставки хімічних речовин (перелічених
  в Додатку ІІІ Конвенції) , а також механізми забезпечення дотримання цих рішень Сторонами - експортерами. Роттердамська конвенція не встановлює жодних обмежень чи бар’єрів
  у міжнародній торгівлі, а лише вимагає інформувати Секретаріат щодо  рішень по імпорту хімічних речовин, прийнятих на національному рівні. У свою чергу, в рамках конвенції
  країна - член буде поінформована щодо обмежень і правил інших країн - учасниць і, таким чином, зможе ефективніше координувати свої  міжнародні торгові відносини.`
    },
    {
      'id': 3,
      'description': 'ТОП-3 ягоди за обсягами вирощування в Україні',
      'date': '3 лютого 2018',
      'photoUrl': 'https://agronews.ua/sites/default/files/images/352_1.640.jpg',
      'content': `За насадженнями ягідних культур у сільгосппідприємствах в Україні лідирує смородина. Вона займає 50% усіх площ, згідно з даними Державної служби статистики, і 40% – за неофіційною статистикою
      Про це повідомила директор плодорозсадника «Брусвяна» Ліліана Дмітрієва.
  На другому місці – суниця садова: 24 % – офіційно і 20 % – приватна статистика.
  На третьому – малина: 14 % і 13 % відповідно.
  Четверта позиція, за офіційною статистикою, належить лохині з 13 % . Проте приватна статистика нарахувала близько 24 % загальних площ під цією ягодою у господарствах, що займаються ягідництвом професійно.
  Також, за словами Ліліани Дмітрієвої, в Україні масово збільшуються насадження обліпихи, жимолості та суниці лісової.`
    },
    {
      'id': 4,
      'description': 'У Держпродспоживслужбі не підтвердили масове використання антибіотиків у м\'ясній продукції',
      'photoUrl': 'https://agronews.ua/sites/default/files/images/355_4.jpg',
      'content': `Заявляти про використання антибіотиків у продуктах харчування можна лише на підставі лабораторних досліджень.. Про це розповів очільник Держпродспоживслужби Володимир Лапа
      Давати оцінки щодо наявності антибіотиків у будь-якій продукції, в тому числі і в тваринницькій, без попередніх лабораторних досліджень не можна. Справа у тому, що по багатьох видам тваринницької
      продукції використання антибіотиків не заборонено, адже організм тварини, як і організм людини, по багатьох хворобах потребує антибіотиків. Якщо виробник дотримується так званої культури
    використання антибіотиків - їх залишкова кількість не перевищує допустимих норм\', - пояснив Лапа. Держпродспоживслужба контролює вміст антибіотиків у продукції тваринницького походження н'
  постійній основі, наголосив Лапа. \'У нас діє державна програма моніторингу антибіотиків. За нашими дослідженнями є певна кількість невідповідностей, але вона дуже не суттєва. На додаток до цьог'
- наша продукція експортується в десятки країн світу - і там точно так само її перевіряють. Тому, мені здається що заяви про масове використання антибіотиків у тваринницькій продукції - це не більше,
  аніж не кваліфіковані коментарі\', - зазначив він. Нагадаємо, у березні поточного року контроль якості української курятини перевіряла Місія Генерального директорату Європейської Комісії з питан'
  охорони здоров'я та безпечності харчових продуктів (DG SANTE). Перевірку системи державного контролю проводили на ТОВ \"Вінницька птахофабрика\", ПрАТ \"Миронівська птахофабрика\", Миронівськи'
  м'ясопереробний завод \"Легко\" - усіх компаніях агрохолдингу “Миронівський хлібопродукт”, який є одним з найбільших виробників курятини у Європі та найбільшим українським експортером цієї продукці'
  в країни ЄС. За результатами дослідження, Єврокомісія надала висновок про відповідність курятини “МХП” міжнародним стандартам FSSC 22000, ISO 22000 та BRC Food.`
    },
    {
      'id': 5,
      'description': 'На Черкащині побудують елеватор потужністю 50 тис. тонн',
      'date': '4 травня 2018',
      'photoUrl': 'https://agronews.ua/sites/default/files/images/elevator_9.jpg',
      'content': `Агрофірма «Байс-Агро» розпочала будівництво елеватора в Уманському районі Черкаської області. Будівництво розбили на три етапи, пише журнал «Аграрна Еліта України». Планова потужність
      елеватора становить 50 тис. тонн одночасного зберігання зерна. Завершити його будівництво планують мірою збільшення обсягів вирощуваних культур.
      Довідка:
  Агрофірма «Байс-Агро» має в обробітку 14 тис. гектарів землі. Основні напрями виробництва – рослинництво й тваринництво. Крім того, у структурі підприємства є комбікормовий завод, заводи «Уманьпиво»
  й «Уманьхліб»`
    }
  ];
  private _books = [
    {
      name: 'Довідник із захисту польових культур від хвороб та шкідників',
      description: 'Редакція журналу «Пропозиція» випустила оновлений практичний довідник «ЗАХИСТ"',
      photo: 'http://propozitsiya.com/sites/default/files/styles/580x/public/handbook/zashita_rast_2018_s.jpg?itok=SyCZvDGy',
      url: 'http://propozitsiya.com/ua/dovidnyk-iz-zahystu-polovyh-kultur-vid-hvorob-ta-shkidnykiv'
    },
    {
      name: 'Соя: культура унікальних можливостей',
      description: 'У багатоілюстрованому виданні подано значення, поширення, біологічні...',
      photo: 'http://propozitsiya.com/sites/default/files/styles/150x200x/public/handbook/soya_1.jpg?itok=jst-VCDr',
      url: 'http://propozitsiya.com/ua/soya-kultura-unikalnih-mozhlivostey-0'

    },
    {
      name: 'Ремонт тракторів',
      description: 'Понад тридцять професійних рекомендацій  щодо самостійного ремонту тракторів з...',
      photo: 'http://propozitsiya.com/sites/default/files/styles/150x200x/public/handbook/profi_remont_traktorov.jpg?itok=GZs6D19J',
      url: 'http://propozitsiya.com/ua/remont-traktoriv'
    },
    {
      name: 'Довідник із захисту польових культур від хвороб та шкідників',
      description: 'Редакція журналу «Пропозиція» випустила оновлений практичний довідник «ЗАХИСТ"',
      photo: 'http://propozitsiya.com/sites/default/files/styles/580x/public/handbook/zashita_rast_2018_s.jpg?itok=SyCZvDGy',
      url: 'http://propozitsiya.com/ua/dovidnyk-iz-zahystu-polovyh-kultur-vid-hvorob-ta-shkidnykiv'
    },
    {

      name: 'Визначник хвороб і шкідників цукрового буряка',
      description: 'Видання кишенькового формату. Морфологічні особливості, зовнішні ознаки хвороб',
      photo: 'http://propozitsiya.com/sites/default/files/styles/150x200x/public/handbook/cover_sahar_svekla_0.jpg?itok=2FLsYb0E',
      url: 'http://propozitsiya.com/ua/vyznachnyk-hvorob-i-shkidnykiv-cukrovogo-buryaka'
    },
    {
      name: 'Практичний довідник овочівника. Томат',
      description: 'Все про томат: вибір сортів, технології вирощування у відкритому грунті, захист',
      photo: 'http://propozitsiya.com/sites/default/files/styles/150x200x/public/handbook/cover_tomat.jpg?itok=LbOJ_VoN',
      url: 'http://propozitsiya.com/ua/praktychnyy-dovidnyk-ovochivnyka-tomat'
    },
    {
      name: 'Практичний довідник овочівника. Огірок',
      description: 'Все про огірок: про культуру, технології вирощування',
      photo: 'http://propozitsiya.com/sites/default/files/styles/150x200x/public/handbook/katalog_ogyrec_2016.jpg?itok=9I2mzD8T',
      url: 'http://propozitsiya.com/ua/praktychnyy-dovidnyk-ovochivnyka-ogirok'
    }
  ];
  public isLoaderVisible = false;
  public authorization$ = new BehaviorSubject<boolean>(false);

  constructor(private _http: HttpClient) {
  }

  get news() {
    return this._news;
  }

  get cultures() {
    return this._cultures;
  }

  get books() {
    return this._books;
  }

  get cultures_short() {
    return this.cultures.map(el => el.name);
  }

  onAuth(value: boolean) {
    this.authorization$.next(value);
  }

  //#region Field
  createField(body) {
    return this._http.post(`${this.url}Field`, body);
  }

  getFields(): Observable<Field[]> {
    return this._http.get<Field[]>(`${this.url}Field`);
  }

  removeField(id) {
    return this._http.delete<Field[]>(`${this.url}Field/${id}`);
  }

  //#endregion

  //#region Plan
  createPlan(fieldId: number, body) {
    return this._http.post(`${this.url}Plan/${fieldId}`, body);
  }

  getPlans(fieldId) {
    return this._http.get<Field[]>(`${this.url}Plan/${fieldId}`);
  }

  editPlan(fieldId, planId, body) {
    return this._http.put(`${this.url}Plan/${fieldId}/${planId}`, body);
  }

  deletePlan(fieldId, planId) {
    return this._http.delete(`${this.url}Plan/${fieldId}/${planId}`);
  }

  //#endregion

  //#region Loader
  toggleLoader() {
    this.isLoaderVisible = !this.isLoaderVisible;
  }

  showLoader() {
    if (!this.isLoaderVisible) {
      this.toggleLoader();
    }
  }

  hideLoader() {
    if (this.isLoaderVisible) {
      this.toggleLoader();
    }
  }

  //#endregion

  //#region Auth
  login(body) {
    return this._http.post(`${this.url}account/token`, body);
  }

  registration(body) {
    return this._http.post(`${this.url}account/register`, body);

  }

  //#endregion
}
